---
kind: method
id: M:Autodesk.Revit.DB.TableCellCalculatedValueData.GetName
source: html/5e444adc-0bc1-6fe7-e116-dd55692196d4.htm
---
# Autodesk.Revit.DB.TableCellCalculatedValueData.GetName Method

Gets the name of the calculated value.

## Syntax (C#)
```csharp
public string GetName()
```